{
  "format": "layers-model",
  "generatedBy": "2.12.0",
  "convertedBy": "manual-final",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "graamsehat_triage",
      "trainable": true,
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              132
            ],
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "bn_1",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "drop_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "bn_2",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "drop_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "dtype": "float32",
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "drop_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.1
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "output",
            "trainable": true,
            "dtype": "float32",
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.12.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            132,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_1/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_1/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_1/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_1/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_2/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_2/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_2/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bn_2/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            16,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}